DataProcessors/Дашборд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>Дашборд</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОбращенияВПоддержку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОбращенияВПоддержку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрНакопления</xr:Item>
				<xr:Item>InformationRegister.ИсторияИзмененийОбращений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПоступления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРеакцииФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРешенияФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тональность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоНазначениеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РешитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРеакцииРегламент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРешенияРегламент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияСообщений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВремя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/Дашборд/Forms/Форма/Ext/Form/Module.bsl
Функция ПолучитьДанныеКатегории()		СоответствиеСерий  = Новый Соответствие;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбращенияВПоддержку.Категория.Наименование КАК Наименование,
	                      |	КОЛИЧЕСТВО(ОбращенияВПоддержку.Номер) КАК Количество
	                      |ИЗ
	                      |	Документ.ОбращенияВПоддержку КАК ОбращенияВПоддержку
	                      |ГДЕ
	                      |	ОбращенияВПоддержку.ДатаСоздания МЕЖДУ &ДатаОт И &ДатаДо
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОбращенияВПоддержку.Категория.Наименование");    
	
	Запрос.УстановитьПараметр("ДатаОт", НачалоДня(Объект.ДатаОт));    Запрос.УстановитьПараметр("ДатаДо", КонецДня(Объект.ДатаДо));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();  
	
	
	МассивКатегорий = Новый Массив;	
	МассивЗначения = Новый Массив;	
	Пока Выборка.Следующий() Цикл  
		МассивКатегорий.Добавить(Выборка.Наименование);
		МассивЗначения.Добавить(Выборка.Количество);
	КонецЦикла;
	
	Данные = Новый Структура;    Данные.Вставить("Категории", МассивКатегорий);    Данные.Вставить("Значения", МассивЗначения);
	
	Возврат Данные;КонецФункции

Функция ПолучитьДанныеИсточники()
	
	СоответствиеСерий  = Новый Соответствие;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбращенияВПоддержку.КаналПоступления.Наименование КАК Наименование,
	                      |	КОЛИЧЕСТВО(ОбращенияВПоддержку.Номер) КАК Количество
	                      |ИЗ
	                      |	Документ.ОбращенияВПоддержку КАК ОбращенияВПоддержку
	                      |ГДЕ
	                      |	ОбращенияВПоддержку.ДатаСоздания МЕЖДУ &ДатаОт И &ДатаДо
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОбращенияВПоддержку.КаналПоступления.Наименование");
	
	Запрос.УстановитьПараметр("ДатаОт", НачалоДня(Объект.ДатаОт));
    Запрос.УстановитьПараметр("ДатаДо", КонецДня(Объект.ДатаДо));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивИсточники = Новый Массив;	
	МассивЗначения = Новый Массив;	
	Пока Выборка.Следующий() Цикл  
		МассивИсточники.Добавить(Выборка.Наименование);
		МассивЗначения.Добавить(Выборка.Количество);
	КонецЦикла;
	
	Данные = Новый Структура;
    Данные.Вставить("Источники", МассивИсточники);
    Данные.Вставить("Значения", МассивЗначения);
	
	Возврат Данные;
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоОбращенийПоСтатусам() 
	КоличествоОбращенийПоСтатусам = Новый Соответствие();
	КоличествоОбращенийПоСтатусам.Вставить(Перечисления.СтатусыЗаявок.Новое, 0);
	КоличествоОбращенийПоСтатусам.Вставить(Перечисления.СтатусыЗаявок.КВыполнению, 0);
	КоличествоОбращенийПоСтатусам.Вставить(Перечисления.СтатусыЗаявок.ВРаботе, 0);
	КоличествоОбращенийПоСтатусам.Вставить(Перечисления.СтатусыЗаявок.ВОжидании, 0);
	КоличествоОбращенийПоСтатусам.Вставить(Перечисления.СтатусыЗаявок.Выполнено, 0);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбращенияВПоддержку.Статус КАК Статус,
	                      |	КОЛИЧЕСТВО(ОбращенияВПоддержку.Статус) КАК КоличествоОбращений
	                      |ИЗ
	                      |	Документ.ОбращенияВПоддержку КАК ОбращенияВПоддержку
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОбращенияВПоддержку.Статус");
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 
		КоличествоОбращенийПоСтатусам[Выборка.Статус] = Выборка.КоличествоОбращений;
	КонецЦикла; 
	Возврат КоличествоОбращенийПоСтатусам;
КонецФункции

&НаСервере
Процедура ОбновитьКоличествоОбращений()
	КоличествоОбращенийПоСтатусам = ПолучитьКоличествоОбращенийПоСтатусам(); 
	ЭтаФорма.Элементы.КоличествоВсегоНовое.Заголовок = КоличествоОбращенийПоСтатусам[Перечисления.СтатусыЗаявок.Новое];     
	ЭтаФорма.Элементы.КоличествоВсегоКВыполнению.Заголовок = КоличествоОбращенийПоСтатусам[Перечисления.СтатусыЗаявок.КВыполнению];
	ЭтаФорма.Элементы.КоличествоВсегоВРаботе.Заголовок = КоличествоОбращенийПоСтатусам[Перечисления.СтатусыЗаявок.ВРаботе];
	ЭтаФорма.Элементы.КоличествоВсегоВОжидании.Заголовок = КоличествоОбращенийПоСтатусам[Перечисления.СтатусыЗаявок.ВОжидании];
	ЭтаФорма.Элементы.КоличествоВсегоВыполнено.Заголовок = КоличествоОбращенийПоСтатусам[Перечисления.СтатусыЗаявок.Выполнено];

КонецПроцедуры 

&НаКлиенте
Процедура ИнициализироватьДатаДиапазон()
	 Объект.ДатаДо = ТекущаяДата();
	 Объект.ДатаОт = Дата(2025,10,28,10,0,0);
КонецПроцедуры

&НаКлиенте                        
Процедура ПриОткрытии(Отказ)  
	ИнициализироватьДатаДиапазон();
	ОбновитьКоличествоОбращений();
	ВывестиДиаграммы();
КонецПроцедуры &НаКлиентеПроцедура ВывестиДиаграммы()	
  КатегорииДанные = ПолучитьДанныеКатегории();
  СоответствиеСерий  = Новый Соответствие;	
  СоответствиеСерий.Вставить("Количество", КатегорииДанные["Значения"]);   
  ТекстДок = ToastUI.Гистограмма(КатегорииДанные["Категории"], СоответствиеСерий, Новый Структура("title", "Обращения по категориям"));  ИВФ      = ПолучитьИмяВременногоФайла("html");  Оповещение = Новый ОписаниеОповещения("ПослеЗаписиHTMLКатегорииГистограммаКатегории", ЭтотОбъект, ИВФ);  ТекстДок.НачатьЗапись(Оповещение, ИВФ);
  
  КруговаяДанные = Новый Соответствие;
  Счетчик = 0;
  Пока Счетчик < КатегорииДанные["Категории"].Количество() Цикл            КруговаяДанные.Вставить(КатегорииДанные["Категории"][Счетчик], КатегорииДанные["Значения"][Счетчик]);    Счетчик = Счетчик + 1;     
  КонецЦикла; 
  
  ТекстДок = ToastUI.КруговаяДиаграмма(КруговаяДанные, Новый Структура("title", "Обращения по категориям"));
  ИВФ      = ПолучитьИмяВременногоФайла("html");
  Оповещение = Новый ОписаниеОповещения("ПослеЗаписиHTMLКатегорииКруговаяКатегории", ЭтотОбъект, ИВФ);
  ТекстДок.НачатьЗапись(Оповещение, ИВФ);
  
  ИсточникиДанные = ПолучитьДанныеИсточники();
  СоответствиеСерий  = Новый Соответствие;	
  СоответствиеСерий.Вставить("Количество", ИсточникиДанные["Значения"]); 

  ТекстДок = ToastUI.Гистограмма(ИсточникиДанные["Источники"], СоответствиеСерий, Новый Структура("title", "Обращения по источнику"));
  ИВФ      = ПолучитьИмяВременногоФайла("html");
  Оповещение = Новый ОписаниеОповещения("ПослеЗаписиHTMLКатегорииГистограммаИсточники", ЭтотОбъект, ИВФ);
  ТекстДок.НачатьЗапись(Оповещение, ИВФ);
  
  КруговаяДанные = Новый Соответствие;
  Счетчик = 0;
  Пока Счетчик < ИсточникиДанные["Источники"].Количество() Цикл        
    КруговаяДанные.Вставить(ИсточникиДанные["Источники"][Счетчик], ИсточникиДанные["Значения"][Счетчик]);
    Счетчик = Счетчик + 1;     
  КонецЦикла; 

  ТекстДок = ToastUI.КруговаяДиаграмма(КруговаяДанные, Новый Структура("title", "Обращения по источнику"));
  ИВФ      = ПолучитьИмяВременногоФайла("html");
  Оповещение = Новый ОписаниеОповещения("ПослеЗаписиHTMLКатегорииКруговаяИсточники", ЭтотОбъект, ИВФ);
  ТекстДок.НачатьЗапись(Оповещение, ИВФ);
  КонецПроцедуры&НаКлиентеПроцедура ПослеЗаписиHTMLКатегорииГистограммаКатегории(Результат, ДополнительныеПараметры) Экспорт  ПервыйГрафик = ДополнительныеПараметры;КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗаписиHTMLКатегорииКруговаяКатегории(Результат, ДополнительныеПараметры) Экспорт
  ВторойГрафик = ДополнительныеПараметры;
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗаписиHTMLКатегорииГистограммаИсточники(Результат, ДополнительныеПараметры) Экспорт
  ТретийГрафик = ДополнительныеПараметры;
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗаписиHTMLКатегорииКруговаяИсточники(Результат, ДополнительныеПараметры) Экспорт
  ЧетвертыйГрафик = ДополнительныеПараметры;
КонецПроцедуры 


&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьКоличествоОбращений();
	ВывестиДиаграммы();
КонецПроцедуры
